#!/usr/bin/env python
# -*- coding: utf-8 -*-
# encoding=utf8
#
# 作者：王煜
# 功能：此范例是模拟下级平台向目标上级推送业务级联信息


###########################################################################
# 首先是配置信息

OPENAPI_URL = "http://192.168.55.156:6803/openapi/levam/platform/upload/hs/basic/info?domain=%s&authkey=%s"

# 警情信息上报格式
# {
#     "cj":[
#         {
#             "cjdh":"", # 处警单号
#             "cjdw":"", # 处警单位
#             "cjdwmc":"", # 处警单位名称
#             "cjr":"", # 处警人
#             "cjrmc":"", # 处警人名称
#             "cjsj":"2019-07-13T15:52:04.265Z", # 处警时间
#             "ddxcsj":"2019-07-13T15:52:04.265Z", # 到达现场时间
#             "djsj":"2019-07-13T15:52:04.265Z", #
#             "gxsj":"2019-07-13T15:52:04.265Z", # 更新时间
#             "jqbh":"", # 警情编号
#             "mjyj":"" # 民警***
#         }
#     ]
# }

# 接警信息上报格式
# {
#     "jj": [
#         {
#             "bjfs":"", # 报警方式
#             "bjnr":"", # 报警内容
#             "bjrdh":"", # 报警人电话
#             "bjrxb":"", # 报警人性别
#             "bjrxm":"", # 报警人姓名
#             "bjsj":"2019-07-13T15:52:04.265Z",
#             "djsj":"2019-07-13T15:52:04.265Z",
#             "gxsj":"2019-07-13T15:52:04.265Z",
#             "jjdw":"", # 接警单位
#             "jjr":"", # 接警人
#             "jjrmc":"", # 接警人名称
#             "jqbh":"", # 警情编号
#             "jqlb":"", # 警情类别
#             "jqlbmc":"", # 警情类别名称
#             "jqmc":"", # 警情名称
#             "sfdd":"", # 事发地点
#             "sfsj":"2019-07-13T15:52:04.265Z", # 事发时间
#             "wj":[
#                 ""
#             ] # 文件
#         }
#     ]
# }

# 案件信息上报格式
# {
#     "aj": [
#         {
#             "afdd":"", # 案发地址
#             "afsj":"2019-07-13T15:52:04.265Z", # 案发时间
#             "ajbh":"", # 案件编号
#             "ajlb":"", # 案件类别
#             "ajlbmc":"", # 案件类别名称
#             "ajly":"", # 案件来源
#             "ajmc":"", # 案件名称
#             "anzt":"", # 案件状态
#             "jasj":"2019-07-13T15:52:04.265Z", # 结案时间？
#             "jjbh":[
#                 ""
#             ], # 接警编号
#             "jyaq":"", # 警员案情？
#             "lasj":"2019-07-13T15:52:04.265Z", # 立案时间
#             "rksj":"2019-07-13T15:52:04.265Z", # 入库时间
#             "sldw":"", # **单位
#             "sldwmc":"", # **单位名称
#             "wjxx":[
#                 {
#                     "clfl":"", # ****
#                     "gllx":"ZDGL", # 关联类型
#                     "wjbh":"", # 文件编号
#                 }
#             ], # 文件信息
#             "ysqssj":"2019-07-13T15:52:04.265Z", # 移送起诉时间
#             "zbdw":"", # 追捕单位
#             "zbdwmc":"",
#             "zbmjxm":"", # 追捕民警姓名
#             "zbr":"" # 追捕人
#         }
#     ]
# }
